export default function Homepage4(){

    const  from_ans =[
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },
        { 'ลำดับ':1,
           'รายละเอียดการประเมิน':'อาจาร์ยได้แจ้งกำหนดการเรียนในส่วนที่อาจาร์ยรับผิดชอบ',
           'SD':'ege',
           'x':0.66,
           'ระดับ':'มาก'
        },

    ]
  

    


  
    return ( <>
    <div className="flex-col space-y-3 bg-gray-300 block  h-full justify-center p-4">
        <div className=" text-center">
            <h1>แบบประเมินรายวิชา</h1>
            <p>หลักสูตรประกาศนียบัตรผู้ช่วยพยาบาล รุ่น... ปีการศึกษา...</p>
            <p>รายวิชา.....................</p>
        </div>
        <h2>ระดับคะแนน</h2>
        <div>
            <p>ค่าเฉลี่ย 4.50 ขึ้นไป หมายถึง พึงพอใจในระดับมากที่สุด</p>
            <p>ค่าเฉลี่ย 4.50 ขึ้นไป หมายถึง พึงพอใจในระดับมากที่สุด</p>
            <p>ค่าเฉลี่ย 4.50 ขึ้นไป หมายถึง พึงพอใจในระดับมากที่สุด</p>
            <p>ค่าเฉลี่ย 4.50 ขึ้นไป หมายถึง พึงพอใจในระดับมากที่สุด</p>
            <p>ค่าเฉลี่ย 4.50 ขึ้นไป หมายถึง พึงพอใจในระดับมากที่สุด</p>
        </div>
        
        <table className=" w-full text-sm text-left text-gray-500 dark:text-gray-400">
       <thead className="text-xs text-gray-700 uppercase bg-gray-50 dark:bg-gray-700 dark:text-gray-400">
         <tr  >
            <th scope="col" className="py-3 px-6" >ข้อ</th>
            <th scope="col" className="py-3 px-6">รายละเอียดการประเมิน</th>
            <th scope="col" className="py-3 px-6">x</th>
            <th scope="col" className="py-3 px-6">SD</th>
            <th scope="col" className="py-3 px-6">ระดับ</th>
         </tr>
       </thead>
       {from_ans.map((from_ans, index) => (
               <tbody>
               <tr data-index={index} className=" hover:bg-green-300 bg-white border-b dark:bg-gray-800 dark:border-gray-700" 
               >
                 <td className="py-4 px-6" >{from_ans.ลำดับ}</td>
                 <td className="py-4 px-6">{from_ans.รายละเอียดการประเมิน}</td>
                 <td className="py-4 px-6">{from_ans.x}</td>
                 <td className="py-4 px-6">{from_ans.SD}</td>
                 <td className="py-4 px-6">{from_ans.ระดับ}</td>
               </tr>
               </tbody>
       ))} 

  
     </table>
     <h3>ข้อเสนอแนะ</h3>
     <p>1.ด้วยรายวิชาเป็นเนื้อหารูปแบบกฎหมาย นิสิตจึงเข้าใจยากแต่อยากจะ ขอบคุณ อจ ผู้สอนที่พยายามปรับเนื้อหาเพื่อให้นิสิตเข้าใจ</p>
     <p>2.ส่วนกฎหมายที่สั่งรายงาน อยากให้สอนก่อนแล้วสั่งงานจะได้สโคปเนื้อหางานได้ครอบคลุม</p>
     <p>3.รวบรวมสถานการณ์ ยกตัวอย่าง ที่จะพบใน รพ.ให้นักเรียนเข้าใจ</p>
        

    </div>



    </>
    )
  }
  